<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    */

    'failed'     => 'Имя пользователя и пароль не совпадают.',
    'throttle'   => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
    'new'        => 'Ваша учетная запись станет доступной после проверки администратором.',
    'failedPass' => 'Вы ввели не верный папроль.',

    'status' => [
        '0' => 'Ваша учетная запись, еще не прошла проверку. Попробуйте позже.',
        '2' => 'Ваша учетная запись заблокирована.'
    ],

];
