<?php

return [
    'empty' => 'Нет данных для отображения',

    'page' => [
        'title' => 'Пустой заголовок',
        'description' => 'Описание страницы',
    ],

    'profile' => [
        'title' => 'Профиль',
        'description' => 'Данные пользователя',
    ],

    'vk_bots' => [
        'title'       => 'ВК Чатботы',
        'description' => 'Управление чатботами ВК',
        'create' => [
            'title'      => 'Добавление чатбота ВК',
            'breadcrumb' => 'Добавление',
        ],
        'edit' => [
            'title'      => 'Редактирование чатбота ВК',
            'breadcrumb' => 'Редактирование',
        ],
        'test' => [
            'title'      => 'Тест чатбота ВК',
            'breadcrumb' => 'Тест',
            'table' => [
                'title' => 'Список комманд',
            ],
        ],
        'trash' => [
            'title'      => 'Корзина с чатботами',
            'breadcrumb' => 'Корзина ВК',
        ],
    ],

    'vk_commands' => [
        'title'       => 'Комманды',
        'create' => [
            'title'      => 'Добавление команды',
            'breadcrumb' => 'Добавление',
        ],
        'edit' => [
            'title'      => 'Редактирование команды',
            'breadcrumb' => 'Редактирование',
        ],
    ],

    'users' => [
        'title' => [
            'all'    => 'Все пользователи',
            'new'    => 'Новые пользователи',
            'active' => 'Активные пользователи',
            'blocked'=> 'Заблокированные пользователи',
            'admin'  => 'Администраторы',
        ],
        'description' => 'Поиск и управление пользователями',
        'links' => [
            'all'    => 'Все',
            'new'    => 'Новые',
            'active' => 'Активные',
            'blocked'=> 'Заблокированные',
            'admin'  => 'Администраторы',
        ],
        'search' => [
            'placeholder' => 'Поиск по имени и почте',
            'button' => 'Поиск',
        ],
        'table' => [
            'title' => 'Список пользователей',
        ],
    ],

    'table' => [
        'head' => [
            'id'         => '#',
            'logo'       => 'Фото',
            'name_email' => 'Имя/Email',
            'name'       => 'Название',
            'description'=> 'Описание',
            'command'    => 'Команда',
            'commands'   => 'Команды',
            'status'     => 'Статус',
            'password'   => 'Пароль',
            'dates'      => 'Даты',
            'action'     => 'Действие',
            'type'       => 'Тип',
        ],
    ],

];