<?php

return [
    'form' => [
        'error' => 'Ошибка введенных данных.',
    ],
    'update' => [
        'profile' => 'Профиль успешно обновлен.',
        'password' => 'Пароль успешно обновлен.',
    ],
    'user' => [
        'console' => [
            'create' => 'Пользователь успешно добавлен.'
        ],
        'logo' => [
            'success' => 'Фото успешно обновленно.',
            'error'   => 'Ошибка сохранения фото.'
        ]
    ],
    'users' => [
        'modal' => [
            'set_user'    => 'Установить роль "пользователь"?',
            'set_admin'   => 'Установить роль "администратор"?',
            'set_active'  => 'Активировать пользователя?',
            'set_blocked' => 'Заблокировать пользователя?',
            'remove'      => 'Удалить пользователя?',
        ],
        'update' => 'Пользователь :fio, обновлен.',
        'remove' => 'Пользователь :fio, удален.',
    ],
    'vk_bot' => [
        'modal'        => [
            'remove'  => 'Удалить чатбот?',
            'restore' => 'Востановить чатбот?',
        ],
        'update'       => 'Чатбот :name, успешно сохранен.',
        'delete'       => 'Чатбот :name, перемещен в корзину.',
        'restore'      => 'Чатбот :name, востановлен.',
        'force_delete' => 'Чатбот :name, удален.',
    ],
    'callback_api' => [
        'vk' => 'Адресс сервера для Callback API',
    ],
    'commands' => [
        'create' => 'Команда успешно созданна.',
        'update' => 'Команда успешно обновлена.',
        'delete' => 'Команда успешно удаленна.',
        'modal'  => [
            'remove'      => 'Удалить команду?',
            'remove_info' => 'Комманду не возможно будет востановить.'
        ],
    ],
];